package com.example.mainprojectkt.data.local

import android.content.Context
import android.net.Uri
import android.util.Log
import com.itextpdf.text.pdf.PdfReader
import com.itextpdf.text.pdf.parser.PdfTextExtractor
import java.io.File
import java.net.URI

class BADataSource(val context: Context) {
    val text = "Раздвинули бостонные столы, составились партии, и гости графа разместились в двух гостиных, диванной и библиотеке.\n" +
            "Граф, распустив карты веером, с трудом удерживался от привычки послеобеденного сна и всему смеялся. Молодежь, подстрекаемая графиней, собралась около клавикорд и арфы. Жюли первая, по просьбе всех, сыграла на арфе пиеску с вариациями и вместе с другими девицами стала просить Наташу и Николая, известных своею музыкальностью, спеть что-нибудь. Наташа, к которой обратились, как в большой, была, видимо, этим очень горда, но вместе с тем и робела.\n" +
            "— Что будем петь? — спросила она.\n" +
            "— «Ключ», — отвечал Николай.\n" +
            "— Ну, давайте скорее. Борис, идите сюда, — сказала Наташа. — А где же Соня?\n" +
            "Она оглянулась и, увидав, что ее друга нет в комнате, побежала за ней.\n" +
            "Вбежав в Сонину комнату и не найдя там своей подруги, Наташа пробежала в детскую — и там не было Сони. Наташа поняла, что Соня была в коридоре на сундуке. Сундук в коридоре был место печалей женского молодого поколения дома Ростовых. Действительно, Соня в своем воздушном розовом платьице, приминая его, лежала ничком на грязной полосатой няниной перине, на сундуке и, закрыв лицо пальчиками, навзрыд плакала, подрагивая своими оголенными плечиками. Лицо Наташи, оживленное, целый день именинное, вдруг изменилось: глаза ее остановились, потом содрогнулась ее широкая шея, углы губ опустились.\n" +
            "— Соня! что ты?.. Что, что с тобой? У-у-у!..\n" +
            "И Наташа, распустив свой большой рот и сделавшись совершенно дурною, заревела, как ребенок, не зная причины и только оттого, что Соня плакала. Соня хотела поднять голову, хотела отвечать, но не могла и еще больше спряталась. Наташа плакала, присев на синей перине и обнимая друга. Собравшись с силами, Соня приподнялась, начала утирать слезы и рассказывать.\n" +
            "— Николенька едет через неделю, его... бумага... вышла... он сам мне сказал... Да я бы все не плакала (она показала бумажку, которую держала в руке: то были стихи, написанные Николаем)... я бы все не плакала, но ты не можешь... никто не может понять... какая у него душа.\n" +
            "И она опять принялась плакать о том, что душа его была так хороша.\n" +
            "— Тебе хорошо... я не завидую... я тебя люблю, и Бориса тоже, — говорила она, собравшись немного с силами, — он милый... для вас нет препятствий. А Николай мне cousin... надобно... сам митрополит... и то нельзя. И потом, ежели маменьке (Соня графиню и считала и называла матерью)... она скажет, что я порчу карьеру Николая, у меня нет сердца, что я неблагодарная, а право... вот ей-богу (она перекрестилась)... я так люблю и ее и всех вас, только Вера одна... За что? Что я ей сделала? Я так благодарна вам, что рада бы всем пожертвовать, да мне нечем...\n" +
            "Соня не могла больше говорить и опять спрятала голову в руках и перине. Наташа начинала успокоиваться, но по лицу ее видно было, что она понимала всю важность горя своего друга.\n" +
            "— Соня! — сказала она вдруг, как будто догадавшись о настоящей причине огорчения кузины. — Верно, Вера с тобой говорила после обеда? Да?\n" +
            "— Да, эти стихи сам Николай написал, а я списала еще другие; она и нашла их у меня на столе и сказала, что покажет их маменьке, и еще говорила, что я неблагодарная, что маменька никогда не позволит ему жениться на мне, а он женится на Жюли. Ты видишь, как он с ней целый день... Наташа! За что?..\n" +
            "И опять она заплакала горче прежнего. Наташа приподняла ее, обняла и, улыбаясь сквозь слезы, стала ее успокоивать.\n" +
            "— Соня, ты не верь ей, душенька, не верь. Помнишь, как мы все втроем говорили с Николенькой в диванной; помнишь, после ужина? Ведь мы все решили, как будет. Я уже не помню как, но помнишь, как было все хорошо и все можно. Вот дяденьки Шиншина брат женат же на двоюродной сестре, а мы ведь троюродные. И Борис говорил, что это очень можно. Ты знаешь, я ему все сказала. А он такой умный и такой хороший, — говорила Наташа... — ты, Соня, не плачь, голубчик милый, душенька, Соня. — И она целовала ее смеясь. — Вера злая, Бог с ней! А все будет хорошо, и маменьке она не скажет; Николенька сам скажет, и он и не думал об Жюли.\n" +
            "И она целовала ее в голову. Соня приподнялась, и котеночек оживился, глазки заблистали, и он готов был, казалось, вот-вот взмахнуть хвостом, вспрыгнуть на мягкие лапки и опять заиграть с клубком, как ему и было прилично.\n" +
            "— Ты думаешь? Право? Ей-богу? — сказала она, быстро оправляя платье и прическу.\n" +
            "— Право! ей-богу! — отвечала Наташа, оправляя своему другу под косой выбившуюся прядь жестких волос.\n" +
            "И они обе засмеялись.\n" +
            "— Ну, пойдем петь «Ключ».\n" +
            "— Пойдем.\n" +
            "— А знаешь, этот толстый Пьер, что против меня сидел, такой смешной! — сказала вдруг Наташа, останавливаясь. — Мне очень весело!\n" +
            "И Наташа побежала по коридору.\n" +
            "Соня, отряхнув пух и спрятав стихи за пазуху, к шейке с выступавшими костями груди, легкими, веселыми шагами, с раскрасневшимся лицом, побежала вслед за Наташей по коридору в диванную. По просьбе гостей молодые люди спели квартет «Ключ», который всем очень понравился; потом Николай спел вновь выученную им песню:\n" +
            "В приятну ночь, при лунном свете,\n" +
            "Представить счастливо себе,\n" +
            "Что некто есть еще на свете,\n" +
            "Кто думает и о тебе!\n" +
            "Что и она, рукой прекрасной\n" +
            "По арфе золотой бродя,\n" +
            "Своей гармониею страстной\n" +
            "Зовет к себе, зовет тебя!\n" +
            "Еще день, два, и рай настанет...\n" +
            "Но ах! твой друг не доживет!\n" +
            "И он не допел еще последних слов, когда в зале молодежь приготовилась к танцам, а на хорах застучали ногами и закашляли музыканты.\n" +
            " \n" +
            "Пьер сидел в гостиной, где Шиншин, как с приезжим из-за границы, завел с ним скучный для Пьера политический разговор, к которому присоединились и другие. Когда заиграла музыка, Наташа вошла в гостиную и, подойдя прямо к Пьеру, смеясь глазами и краснея, сказала:\n" +
            "— Мама велела вас просить танцевать.\n" +
            "— Я боюсь спутать фигуры, — сказал Пьер, — но ежели вы хотите быть моим учителем...\n" +
            "И он подал свою толстую руку, низко опуская ее, тоненькой девочке.\n" +
            "Пока расстанавливались пары и строили музыканты, Пьер сел с своей маленькой дамой. Наташа была совершенно счастлива: она танцевала с большим, с приехавшим из-за границы. Она сидела на виду у всех и разговаривала с ним, как большая. У нее в руке был веер, который ей дала подержать одна барышня. И, приняв самую светскую позу (Бог знает, где и когда она этому научилась), она, обмахиваясь веером и улыбаясь через веер, говорила с своим кавалером.\n" +
            "— Какова? какова? Смотрите, смотрите, — сказала старая графиня, проходя через залу и указывая на Наташу.\n" +
            "Наташа покраснела и засмеялась.\n" +
            "— Ну, что вы, мама? Ну, что вам за охота? Что ж тут удивительного?\n" +
            " \n" +
            "В середине третьего экосеза зашевелились стулья в гостиной, где играли граф и Марья Дмитриевна, и бо́льшая часть почетных гостей и старички, потягиваясь после долгого сидения и укладывая в карманы бумажники и кошельки, выходили в двери залы. Впереди шла Марья Дмитриевна с графом — оба с веселыми лицами. Граф с шутливою вежливостью, как-то по-балетному, подал округленную руку Марье Дмитриевне. Он выпрямился, и лицо его озарилось особенною молодецки-хитрою улыбкой, и как только дотанцевали последнюю фигуру экосеза, он ударил в ладоши музыкантам и закричал на хоры, обращаясь к первой скрипке:\n" +
            "— Семен! Данилу Купора знаешь?\n" +
            "Это был любимый танец графа, танцованный им еще в молодости. (Данило Купор была собственно одна фигура англеза).\n" +
            "— Смотрите на папа́, — закричала на всю залу Наташа (совершенно забыв, что она танцует с большим), пригибая к коленам свою кудрявую головку и заливаясь своим звонким смехом по всей зале.\n" +
            "Действительно, всё, что только было в зале, с улыбкою радости смотрело на веселого старичка, который рядом с своею сановитою дамой, Марьей Дмитриевной, бывшей выше его ростом, округлял руки, в такт потряхивая ими, расправлял плечи, вывертывал ноги, слегка притопывая, и все более и более распускавшеюся улыбкой на своем круглом лице приготовлял зрителей к тому, что будет. Как только заслышались веселые, вызывающие звуки Данилы Купора, похожие на развеселого трепачка, все двери залы вдруг заставились с одной стороны мужскими, с другой — женскими улыбающимися лицами дворовых, вышедших посмотреть на веселящегося барина."
    fun getText(number: Int): String{
        if (number == 1)
            return text
        return "There is no text yet"
    }

    fun getTextUri(uri: Uri, number: Int): String{
        Log.d("TAG", "!")
        val pdfReader = PdfReader(context.contentResolver.openInputStream(uri))
        return PdfTextExtractor.getTextFromPage(pdfReader, number)
    }
}